Martial-World/app/controllers/arts_controller.rb

SELECT "arts".* FROM "arts"
---
    def index
        @arts = Art.all

SELECT "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
    def show
        begin
            @art = Art.find(params[:id])

INSERT INTO "arts" ("name", "origin", "founder", "founder_img", "style", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        puts 'creating martial art'
        puts params
            art = Art.new(art_params)
        puts "??", art
            if art.save

UPDATE "arts" SET "name" = $1, "origin" = $2, "founder" = $3, "founder_img" = $4, "style" = $5, "description" = $6, "updated_at" = $7 WHERE "arts"."id" = $8  [["name", ""], ["origin", ""], ["founder", "Okanawan People"], ["founder_img", ""], ["style", ""], ["description", ""], ["updated_at", "2019-11-12 15:10:44.968867"], ["id", 31]]
---
    def update
        if @art.update(art_params)

DELETE FROM "arts" WHERE "arts"."id" = $1  [["id", 38]]
---
    def destroy
        @art.destroy

SELECT "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
    def set_art
        @art = Art.find(params[:id])